# RectangleLightShape Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RectangleLightShape Class
Members See Also
---
This class encapsulates a rectangle light shape.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class RectangleLightShape : LightShape
```

Visual Basic
---
```text
Public Class RectangleLightShape _
	Inherits LightShape
```

Visual C++
---
```text
public ref class RectangleLightShape : public LightShape
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..LightShape Autodesk.Revit.DB.Lighting..::..RectangleLightShape
# See Also
RectangleLightShape Members
Autodesk.Revit.DB.Lighting Namespace